<a href="https://colab.research.google.com/github/AdityaDhuri/pandas/blob/main/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
ad = pd.DataFrame(np.random.rand(5,5))

In [ ]:
ad

          0         1         2         3         4
0  0.920282  0.053143  0.619724  0.732757  0.763771
1  0.989967  0.678878  0.928954  0.135636  0.201318
2  0.446693  0.059242  0.666660  0.277344  0.758317
3  0.682334  0.341916  0.231397  0.640342  0.966517
4  0.524456  0.127530  0.727418  0.547657  0.413170

In [ ]:
ad.index= list('ABCDE')

In [ ]:
ad

          0         1         2         3         4
A  0.920282  0.053143  0.619724  0.732757  0.763771
B  0.989967  0.678878  0.928954  0.135636  0.201318
C  0.446693  0.059242  0.666660  0.277344  0.758317
D  0.682334  0.341916  0.231397  0.640342  0.966517
E  0.524456  0.127530  0.727418  0.547657  0.413170

In [ ]:
ad.loc[['A','B'],:]

          0         1         2         3         4
A  0.920282  0.053143  0.619724  0.732757  0.763771
B  0.989967  0.678878  0.928954  0.135636  0.201318

In [ ]:
ad.loc[(ad[0]<0.5) | (ad[3]<0.6)]

          0         1         2         3         4
B  0.989967  0.678878  0.928954  0.135636  0.201318
C  0.446693  0.059242  0.666660  0.277344  0.758317
E  0.524456  0.127530  0.727418  0.547657  0.413170

In [ ]:
ad.iloc[1,1]

0.6788778262489304

In [ ]:
ad.drop(['E'],inplace=True)

In [ ]:
ad

          0         1         2         3         4
A  0.920282  0.053143  0.619724  0.732757  0.763771
B  0.989967  0.678878  0.928954  0.135636  0.201318
C  0.446693  0.059242  0.666660  0.277344  0.758317
D  0.682334  0.341916  0.231397  0.640342  0.966517

In [ ]:
ad.reset_index()

  index         0         1         2         3         4
0     A  0.920282  0.053143  0.619724  0.732757  0.763771
1     B  0.989967  0.678878  0.928954  0.135636  0.201318
2     C  0.446693  0.059242  0.666660  0.277344  0.758317
3     D  0.682334  0.341916  0.231397  0.640342  0.966517

In [ ]:
ad.reset_index(drop=True, inplace=True)

In [ ]:
ad

          0         1         2         3         4
0  0.920282  0.053143  0.619724  0.732757  0.763771
1  0.989967  0.678878  0.928954  0.135636  0.201318
2  0.446693  0.059242  0.666660  0.277344  0.758317
3  0.682334  0.341916  0.231397  0.640342  0.966517

In [ ]:
ad[1]=0

In [ ]:
ad

          0  1         2         3         4
0  0.920282  0  0.619724  0.732757  0.763771
1  0.989967  0  0.928954  0.135636  0.201318
2  0.446693  0  0.666660  0.277344  0.758317
3  0.682334  0  0.231397  0.640342  0.966517

In [ ]:
ad[:1]=0

In [ ]:
ad

          0  1         2         3         4
0  0.000000  0  0.000000  0.000000  0.000000
1  0.989967  0  0.928954  0.135636  0.201318
2  0.446693  0  0.666660  0.277344  0.758317
3  0.682334  0  0.231397  0.640342  0.966517

In [ ]:
ad[:2]=0

In [ ]:
ad

          0  1         2         3         4
0  0.000000  0  0.000000  0.000000  0.000000
1  0.000000  0  0.000000  0.000000  0.000000
2  0.446693  0  0.666660  0.277344  0.758317
3  0.682334  0  0.231397  0.640342  0.966517

In [ ]:
ad=pd.DataFrame(np.random.rand(5,5))

In [ ]:
ad

          0         1         2         3         4
0  0.052887  0.155962  0.049764  0.946775  0.584184
1  0.791016  0.739470  0.661148  0.434155  0.986025
2  0.994045  0.094081  0.106701  0.975228  0.131278
3  0.747283  0.364661  0.236781  0.569910  0.197192
4  0.143442  0.556144  0.869410  0.932034  0.168648

In [ ]:
ad[1,4]=0

In [ ]:
ad

          0         1         2         3         4  (1, 4)
0  0.052887  0.155962  0.049764  0.946775  0.584184       0
1  0.791016  0.739470  0.661148  0.434155  0.986025       0
2  0.994045  0.094081  0.106701  0.975228  0.131278       0
3  0.747283  0.364661  0.236781  0.569910  0.197192       0
4  0.143442  0.556144  0.869410  0.932034  0.168648       0

In [ ]:
ad.iloc[1]=0

In [ ]:
ad

          0         1         2         3         4  (1, 4)
0  0.052887  0.155962  0.049764  0.946775  0.584184       0
1  0.000000  0.000000  0.000000  0.000000  0.000000       0
2  0.994045  0.094081  0.106701  0.975228  0.131278       0
3  0.747283  0.364661  0.236781  0.569910  0.197192       0
4  0.143442  0.556144  0.869410  0.932034  0.168648       0

In [ ]:
ad.iloc[1:4]=0

In [ ]:
ad

          0         1         2         3         4  (1, 4)
0  0.052887  0.155962  0.049764  0.946775  0.584184       0
1  0.000000  0.000000  0.000000  0.000000  0.000000       0
2  0.000000  0.000000  0.000000  0.000000  0.000000       0
3  0.000000  0.000000  0.000000  0.000000  0.000000       0
4  0.143442  0.556144  0.869410  0.932034  0.168648       0

In [ ]:
ad.drop((1,4),axis=1, inplace=True)

In [ ]:
ad[0,3]=1

In [ ]:
ad.drop((0,3),axis=1, inplace=True)

In [ ]:
ad

          0         1         2         3         4
0  0.052887  0.155962  0.049764  0.946775  0.584184
1  0.000000  0.000000  0.000000  0.000000  0.000000
2  0.000000  0.000000  0.000000  0.000000  0.000000
3  0.000000  0.000000  0.000000  0.000000  0.000000
4  0.143442  0.556144  0.869410  0.932034  0.168648

In [ ]:
ad.iloc[1 & 3]=1

In [ ]:
ad

          0         1        2         3         4
0  1.000000  1.000000  1.00000  1.000000  1.000000
1  1.000000  1.000000  1.00000  1.000000  1.000000
2  0.000000  0.000000  0.00000  0.000000  0.000000
3  0.000000  0.000000  0.00000  0.000000  0.000000
4  0.143442  0.556144  0.86941  0.932034  0.168648

In [ ]:
ad.loc[:,[1]]=40

In [ ]:
ad

          0     1        2         3         4
0  1.000000  40.0  1.00000  1.000000  1.000000
1  1.000000  40.0  1.00000  1.000000  1.000000
2  0.000000  40.0  0.00000  0.000000  0.000000
3  0.000000  40.0  0.00000  0.000000  0.000000
4  0.143442  40.0  0.86941  0.932034  0.168648

In [ ]:
ad.loc[[1],[2]]=25

In [ ]:
ad

          0     1         2         3         4
0  1.000000  40.0   1.00000  1.000000  1.000000
1  1.000000  40.0  25.00000  1.000000  1.000000
2  0.000000  40.0   0.00000  0.000000  0.000000
3  0.000000  40.0   0.00000  0.000000  0.000000
4  0.143442  40.0   0.86941  0.932034  0.168648